In [2]:
import pandas as pd

In [4]:
df1= pd.read_csv('Hist-month-tasmax.csv',skiprows=1)
df1['time'] = pd.to_datetime(df1['time'])
df1.head()

  cities       time     lat      lon     tasmax
0  Tokyo 1950-01-01  35.625  139.625  281.38812
1  Tokyo 1950-02-01  35.625  139.625  281.84033
2  Tokyo 1950-03-01  35.625  139.625  283.07350
3  Tokyo 1950-04-01  35.625  139.625  289.07657
4  Tokyo 1950-05-01  35.625  139.625  293.34790

In [6]:
df2= pd.read_csv('Hist-month-tasmin.csv',skiprows=1)
df2['time'] = pd.to_datetime(df2['time'])
df2.head()

  cities       time     lat      lon     tasmin
0  Tokyo 1950-01-01  35.625  139.625  275.24900
1  Tokyo 1950-02-01  35.625  139.625  273.90646
2  Tokyo 1950-03-01  35.625  139.625  275.41818
3  Tokyo 1950-04-01  35.625  139.625  281.53793
4  Tokyo 1950-05-01  35.625  139.625  286.44050

In [8]:
df2=df2.drop(['lat','lon'],axis=1)

In [10]:
final=pd.merge(df1,df2,on=['cities','time'])

In [12]:
final.shape

(83460, 6)

In [16]:
df3= pd.read_csv('Hist-month-pr.csv',skiprows=1)
df3['time'] = pd.to_datetime(df3['time'])
df3.head()

  cities       time     lat      lon         pr
0  Tokyo 1950-01-01  35.625  139.625  151.38026
1  Tokyo 1950-02-01  35.625  139.625   64.06377
2  Tokyo 1950-03-01  35.625  139.625   54.90432
3  Tokyo 1950-04-01  35.625  139.625  138.73988
4  Tokyo 1950-05-01  35.625  139.625  188.84598

In [18]:
df3=df3.drop(['lat','lon'],axis=1)

In [20]:
df=pd.merge(final,df3,on=['cities','time'])

In [22]:
df.head()

  cities       time     lat      lon     tasmax     tasmin         pr
0  Tokyo 1950-01-01  35.625  139.625  281.38812  275.24900  151.38026
1  Tokyo 1950-02-01  35.625  139.625  281.84033  273.90646   64.06377
2  Tokyo 1950-03-01  35.625  139.625  283.07350  275.41818   54.90432
3  Tokyo 1950-04-01  35.625  139.625  289.07657  281.53793  138.73988
4  Tokyo 1950-05-01  35.625  139.625  293.34790  286.44050  188.84598

In [24]:
df.shape

(83460, 7)

In [26]:
df.to_csv('Hist-month.csv')

cities    0
time      0
lat       0
lon       0
pr        0
tasmax    0
tasmin    0
dtype: int64